In [18]:
import os
import pandas as pd
import matplotlib.pyplot as plt
import pymysql
from dotenv import load_dotenv
load_dotenv()

True

In [23]:

hostname = os.environ["HOSTNAME"]
username = 'root'#os.environ["USERNAME"]
password = os.environ["PASS"]
database = os.environ["DATABASE"] 

print("Using pymysql…")


con = pymysql.connect(hostname, username, 
    password, database)

with con:
    
    cur = con.cursor()
    cur.execute("SELECT VERSION()")

    version = cur.fetchone()
    
    print("Database version: {}".format(version[0]))

Using pymysql…
Database version: 5.7.28-0ubuntu0.18.04.4

In [7]:
query = """
        SELECT ANOENC, COUNT(DISTINCT NUMERO) 
        FROM gastos_epf gastos
        GROUP BY ANOENC;
        """


conn = None
try:
    conn = pymysql.connect(hostname, username, password, database)
    cur = conn.cursor()
    cur.execute(query)
    
    # Set it as DF
    df = pd.read_sql(query, con=conn) 
    df.columns = execution.keys()
    
    cur.close()
    #conn.commit()
except (Exception, pymysql.DatabaseError) as error:
    print(error)
finally:
    if conn is not None:
        conn.close()
print('finished')

'int' object has no attribute 'keys'
finished

In [9]:
df

    ANOENC  COUNT(DISTINCT NUMERO)
0     2006                   19435
1     2007                   21542
2     2008                   22077
3     2009                   22346
4     2010                   22203
5     2011                   21680
6     2012                   21808
7     2013                   22057
8     2014                   22146
9     2015                   22130
10    2016                   22010
11    2017                   22043
12    2018                   21395

In [ ]:
query = """
        SELECT  gasto.NUMERO,
                gasto.CODIGO, 
                gasto.ANOENC, 
                gasto.GASTO, 
                hogar.CCAA, 
                hogar.INTERINPSP,
                hogar.INTERIN,
                hogar.NMIEMB,
                hogar.REGTEN,
                hogar.ANNOCON,
                hogar.AGUACALI,
                hogar.NMIEM1
                FROM gastos_epf gasto
                LEFT JOIN hogar_epf hogar
                ON gasto.NUMERO = hogar.NUMERO
                WHERE CODIGO between '04511' and '04551';
        """


conn = None
try:
    conn = pymysql.connect(hostname, username, password, database)
    cur = conn.cursor()
    cur.execute(query)
    
    # Set it as DF
    df = pd.read_sql(query, con=conn) 
    df.columns = execution.keys()
    
    cur.close()
    #conn.commit()
except (Exception, pymysql.DatabaseError) as error:
    print(error)
finally:
    if conn is not None:
        conn.close()
print('finished')

In [12]:
df_test = pd.read_csv('/home/fserrey/Documents/test.csv')

In [13]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
NUMERO              1000 non-null int64
CODIGO              1000 non-null int64
ANOENC              1000 non-null int64
gasto.GASTO/1000    1000 non-null float64
CCAA                1000 non-null int64
INTERINPSP          0 non-null float64
INTERIN             1000 non-null float64
NMIEMB              1000 non-null float64
REGTEN              1000 non-null float64
ANNOCON             1000 non-null float64
AGUACALI            1000 non-null float64
NMIEM1              1000 non-null float64
dtypes: float64(8), int64(4)
memory usage: 93.9 KB